[
    {
        "caption": "A bottle (or 3) of the 2017 Rise is the perfect gift for the wine aficionados in your life. Crafted from hand picked mountainside grapes, this extraordinary wine completes every holiday setting.\n\nGift the delectable 2017 Rise for those you love (and we won’t tell if you keep it all to yourself). Order yours today online or in our tasting room.",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/131240688_375144470443987_3603351527351959194_n.jpg?_nc_cat=108&ccb=2&_nc_sid=8ae9d6&_nc_ohc=3-nASOj2Uw4AX-qzbjN&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=25a59454dc2e4067b6a454672f04ad55&oe=60022B7D",
        "media_type": "IMAGE",
        "id": "17863791191274877"
    },
    {
        "caption": "For those of you interested in the wineries and bottles both pushing the envelope and driving quality in Virginia, our newest Taste of Virginia wine club is perfect for you! Rather than committing to one winery, you will gain access to some of the hardest to find gems from throughout the commonwealth.\n\nEach wine will be small batch, often side projects from some of your favorite winemakers, and usually the wines that sell out before you can grab them.\n\nMake sure you sign up for the Taste of Virginia Club soon for a taste of these delicious and unique wines. We’re already over 50% full for 2021. Learn more about this amazing opportunity via the link in our bio.",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/131309203_376121216824350_1363355728905208030_n.jpg?_nc_cat=100&ccb=2&_nc_sid=8ae9d6&_nc_ohc=DW0UIRvl6fsAX94TeJC&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=1ac4a8795e8ba52ed411b80730183f44&oe=60038CD3",
        "media_type": "IMAGE",
        "id": "17855857373346943"
    },
    {
        "caption": "In our 2020 gift guide, you can find the perfect holiday presents for your friends and family. From a beautiful sparkling brut to a rich fruity red, our wine selection has the perfect bottle or gift trio for every loved one. \n\nThis holiday season we are also offering gift cards for our spectacular tasting room. Give the gift of a beautiful experience at Early Mountain. \n\nFind your perfect gift here: https://EarlyMountain.dcatalog.com/v/Holiday-2020-First/",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/129771998_663491184320242_7178287067733463057_n.jpg?_nc_cat=105&ccb=2&_nc_sid=8ae9d6&_nc_ohc=pDCKpYbB-9AAX8uN7Ph&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=7b67bf9aad0b22fc466b4ad2f22dffb1&oe=6000EBAA",
        "media_type": "IMAGE",
        "id": "17885452429891187"
    },
    {
        "caption": "A #hashtagholiday we can support...Happy Cabernet Franc day, world!",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/129718319_138546317773467_6810280587646542037_n.jpg?_nc_cat=105&ccb=2&_nc_sid=8ae9d6&_nc_ohc=AhoRdAhkdhIAX-8A_6b&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=02d47e07eb3c76d090bc4ba28fb08c6a&oe=60019A8B",
        "media_type": "IMAGE",
        "id": "17956405870367091"
    },
    {
        "caption": "This holiday season, make sure your home is stocked with the best of the best. Complete your holiday selection with scrumptious wine pairings that are both accessible and exceptional.\n\nThis is your last chance to order your selection online, with pick up available through Wednesday, November 25th. We will be open again Friday through Sunday with special holiday fare and wine features. Happy Thanksgiving!\n\nPhoto credit: @ashley.p.cox\nTable setting: @bejustcville",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/126907297_1830977373707264_1303981051689304119_n.jpg?_nc_cat=100&ccb=2&_nc_sid=8ae9d6&_nc_ohc=qJtUl_KBADAAX_NdmEw&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=a413f0db54d33872197b30ab3c55a789&oe=6002BB60",
        "media_type": "IMAGE",
        "id": "17864614742148766"
    },
    {
        "caption": "Make your Thanksgiving holiday weekend special this year with a visit to the beautiful Early Mountain Vineyard. Our picturesque outdoor accommodations and elegant wine selection are the perfect combination for a relaxing retreat. \n\nYou can book your reservation through the link in our bio, and you’ll be here before you know it.",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/126079562_723222181966770_384053621398642863_n.jpg?_nc_cat=110&ccb=2&_nc_sid=8ae9d6&_nc_ohc=1UiomzPZ6RsAX9KCTS1&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=10378cb5bf32012547dd91589e378d3c&oe=60000FC5",
        "media_type": "IMAGE",
        "id": "17856120866304366"
    },
    {
        "caption": "@James.suckling reviewed Early Mountain Virginia 2017 Rise, awarding it 92 points! He described the powerful and aromatic red as “racy and energetic,” and the complex flavor profile as “Boysenberry and currant aromas with chocolate and cedar, following through to a medium to full body.” \n\nWe’re honored and excited to share one of our most beautiful wines with you. You can order the 2017 Early Mountain Virginia Rise, packed in custom wood boxes for single, three, or six bottle packs by following the link in our bio.",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/124254171_182917136746495_7605004920002841563_n.jpg?_nc_cat=110&ccb=2&_nc_sid=8ae9d6&_nc_ohc=HpACutW92pgAX-fW2sS&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=f055fd1a257acc811209eb0ff2f292cb&oe=6002CB58",
        "media_type": "IMAGE",
        "id": "17866754186097187"
    },
    {
        "caption": "Join us in celebrating the joy of the holiday season with an elegant Bounty of Virginia Wine Dinner. Executive Chef Tim Moore has created a 5-course dinner paired with new releases and award-winning favorites, including our 2017 RISE and inaugural estate Sparkling release. Create merry memories of 2020 with this intimate and extraordinary dinner experience. \n\nThis season we’re doing things a little bit differently: rather than a communal wine dinner, all tables will be seated as separate parties. With each decadent course, our team will share the vision \"behind the scenes\" of our wines and the bounty we are so honored to elevate.\n\nYou don’t want to miss this incredible dining experience on 12/11 and 12/18 at our vineyard.",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/124003739_126859292279106_8542088097227729501_n.jpg?_nc_cat=104&ccb=2&_nc_sid=8ae9d6&_nc_ohc=bNHEZcGRz6IAX94zSR7&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=e3c6c5a0c902ed30d78ac5c8c6eb822b&oe=6001CB32",
        "media_type": "IMAGE",
        "id": "17902683739594174"
    },
    {
        "caption": "Rise represents the pinnacle of what we do at Early Mountain, with flavors that range from deep and persistent to subtle and suggestive. Using hand selected grapes from our best mountainside vineyard blocks, our talented winemaking team has crafted a unique and extraordinary wine. \n\nWhen you order Rise, it arrives packed in custom wood boxes for single, three, or six bottle packs. Discover the best Early Mountain has to offer this upcoming holiday season: give a bottle to a loved one, or keep it all for yourself.",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/123001020_386662042745670_5144521324516335341_n.jpg?_nc_cat=102&ccb=2&_nc_sid=8ae9d6&_nc_ohc=X-8xtTAt8xAAX9-0HjI&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=48e372fb347905f8e448db14388aeb6b&oe=600351B3",
        "media_type": "IMAGE",
        "id": "17894487430655532"
    },
    {
        "caption": "There’s never been a better time than now to join our wine club! In celebration of Virginia Wine Month, all new Wine Club Members who join by the end of the month will be entered for a chance to win a Wine Country Getaway package.\n\nThis special package includes a night in our dreamy vineyard cottage plus a $100 Gift Certificate for us in the Tasting Room or online shop.\n\nAll Wine Club memberships include quarterly shipments of three bottles hand selected by our winemaker, a complimentary wine tasting for you and a guest every time you visit our tasting room, and 15% discount on all Early Mountain wine purchases.\n\nHead to our website to learn more about our Wine Club and enter to win the Getaway package.",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/122169483_833071304105065_4799758678648913789_n.jpg?_nc_cat=106&ccb=2&_nc_sid=8ae9d6&_nc_ohc=ds1xPazuC3sAX8F5AQp&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=0f19cde3878284474078c26c8fc121b9&oe=6000A932",
        "media_type": "IMAGE",
        "id": "17899336162591705"
    },
    {
        "caption": "Enjoy the lovely fall weather with us in Virginia Wine Country. Whether you’re a quick drive down from D.C. or a road trip away, we’re here for a safe and beautiful weekend outing, because nothing beats a crisp October afternoon around fire pits with friends.\n\nIn the spirit of Virginia Wine Month, come for our amazing wine, and stay for the view.",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/121316892_672921660306043_801926408918500000_n.jpg?_nc_cat=106&ccb=2&_nc_sid=8ae9d6&_nc_ohc=tStkR5pqfHQAX8kN1Kf&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=d603bbc1c09f8289a334018e339d5423&oe=60012015",
        "media_type": "IMAGE",
        "id": "18054373750256030"
    },
    {
        "caption": "On Thursday, we’re releasing one of our most special wines yet, and our wine club members will have the opportunity to [virtually] taste along live with winemaker Ben Jordan and Early Mountain owner Jean Case.\n\nInterested in joining our club? Club membership includes quarterly shipments of three bottles hand selected by our winemaker, a complimentary wine tasting for you and a guest every time you visit our tasting room, and 15% discount on all Early Mountain wine purchases.\n\nHead to our website to sign up to receive September’s wine shipment and get access to our upcoming live tasting with Ben and Jean. #comingsoon #newrelease #wineclub\n\nPhoto: Kate Greer",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/119383110_268103200832643_395938450857566348_n.jpg?_nc_cat=107&ccb=2&_nc_sid=8ae9d6&_nc_ohc=xAfs_40Kab8AX_A1uZT&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=936b1fba06329ed7c17940ef4e43ab21&oe=5FFFE101",
        "media_type": "IMAGE",
        "id": "17872882390912074"
    },
    {
        "caption": "Did you know that the age of a vine influences the quantity and quality of fruit grown? Older vines produce fewer grapes, but they are more concentrated and can yield a bolder, more layered wine. \n\nOur oldest vines are in the Quaker Run vineyard, on the South and South Eastern sides of Doubletop mountain. There, the rocky soils and near constant air flow contribute to growing quite special grapes. You’ll find them in our wines such as Eluvium, Vow, and an upcoming new release. #ComingSoon #NewRelease\n\nPhoto: Kate M. Greer",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/119053214_2704390623179421_6868277860717300378_n.jpg?_nc_cat=110&ccb=2&_nc_sid=8ae9d6&_nc_ohc=7GGbDWfxyIgAX_Hdgx8&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=97fa21ea0560e8409d7a2c0ca4cc1e10&oe=600017CF",
        "media_type": "IMAGE",
        "id": "17866408322006484"
    },
    {
        "caption": "@chef.tim.moore has captured summer in a bowl. Come have a taste - we're open 11 am - 6 pm today. Happy Labor Day!",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/118796729_756202448553163_1205641401609659891_n.jpg?_nc_cat=104&ccb=2&_nc_sid=8ae9d6&_nc_ohc=KGQiH-L72lIAX8JW7wS&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=98f227cedf536b6dfe574968e6cd13ac&oe=6000ABE8",
        "media_type": "IMAGE",
        "id": "17877917332813721"
    },
    {
        "caption": "More weekends like this ☝️, please. How are you celebrating the long weekend?\n\nPhoto: @ashley.p.cox",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/118793911_655767868374408_8475393609661138352_n.jpg?_nc_cat=107&ccb=2&_nc_sid=8ae9d6&_nc_ohc=shP6Cb830rcAX-3l6ek&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=ca36b8632c1d26f9970f9eb20bf54229&oe=6002B831",
        "media_type": "IMAGE",
        "id": "17857396229125507"
    },
    {
        "caption": "If you’ve been with us for years (and if you’re anything like us), you’re probably big fans of our winemaker Ben and viticulturist Maya. If you’re new around here, we are SO pleased to introduce you.\n\nBen is a native Virginian who began his winemaking career in Sonoma County (not before dabbling in theater arts). Much like his screenwriting past, Ben’s winemaking style is one of storytelling, using wine to showcase a moment of time and a place.\n\nHailing from California, Maya has found a new love of wine in central Virginia, by way of studying bubble dynamics of sparkling wine at UC Davis. Maya’s passion for environmentally low-impact viticulture influences all aspects of our responsible growing practices.\n\nTogether, this collaborative duo crafts the incredible wines you know and love. Come September (or even sooner for our wine Club Members), they have a special surprise in store for you 😏. #NewRelease #ComingSoon",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/117888430_331861764673300_3564021713992422703_n.jpg?_nc_cat=110&ccb=2&_nc_sid=8ae9d6&_nc_ohc=UrLYFN7tBPcAX-ouNvV&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=956762a7790e100528882e603a6d20a3&oe=6003186F",
        "media_type": "IMAGE",
        "id": "17850590219253825"
    },
    {
        "caption": "Here we go! There is no question 2020 will be the most memorable vintage we have ever made. First pick Pinot Gris from Early Mountain vineyard for our traditional method sparking. Cheers!\n.\n#vawinetogether",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/117872808_3391251334229081_6143665406565429382_n.jpg?_nc_cat=109&ccb=2&_nc_sid=8ae9d6&_nc_ohc=xD6n33IUqrQAX-TPSIp&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=44c8053fa6faf43dd7427b5d78b17f04&oe=6003512F",
        "media_type": "IMAGE",
        "id": "17852132417234430"
    }
]