[
    {
        "caption": "Four Early Mountain wines (+associate winemaker Maya Hood White’s side hustle R.A.H.) were selected from the almost 600 entries from 100 Virginia Wineries in the 2021 Virginia Governor’s Cup Case competition! \n\nTo receive their gold medals (scores between 90 and 100), our entries were evaluated on their appearance, aroma, flavor, overall quality, and commercial suitability and were deemed “outstanding” or “classic” by the expert judges.    \n\nEarly Mountain’s 2021 Winners are:\n\n2019 Five Forks\n2017 Eluvium\n2019 Capstone Vineyard Cabernet Franc\n2019 Shenandoah Valley Cabernet Franc\n2017 R.A.H. \n\nYou can order the Gold Medal Pack today and sample our 2021 Governor’s Cup Competition Winners: https://store.earlymountain.com/",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/156661773_105000218228829_1912693434187313379_n.jpg?_nc_cat=108&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=wXiyIW6hh2EAX_jCfxZ&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=d37ff0ff901e7b7f388010df87b1332c&oe=606D2173",
        "media_type": "IMAGE",
        "id": "17867645393351882"
    },
    {
        "caption": "Our newest release, the 2020 Rosé, was made for warm sun-filled days, offering bright aromas of strawberries, white peaches, red grapefruit. It’s light on its feet, but has a delicate intensity that lingers.\n\nWhether you want to debut all the complexities of this vintage with friends or enjoy a glass after a long day, this wine is perfect for you.",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/151017772_443162943774513_3606608092028385554_n.jpg?_nc_cat=111&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=NBGXsdD2B2AAX-ygej_&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=8507b5c1fa6bda642a37b04e5c6b39a0&oe=606B1590",
        "media_type": "IMAGE",
        "id": "17879134220160188"
    },
    {
        "caption": "If you needed some good news today, here it is: rosé season has officially arrived!\n\nThe brightness, lightness, and silky texture of the 2020 Rosé release is the perfect way to treat yourself after these ice-filled days. Come visit the vineyard and enjoy a sip in the sun, or order your own bottle of sunshine (aka rosé) online today.",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/152874601_169403071476818_6502484982130685785_n.jpg?_nc_cat=109&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=428rChRH1FYAX-ULOkG&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=73bf43cb7f205c567cd1e2ceb80a0aa9&oe=606C6CCA",
        "media_type": "IMAGE",
        "id": "17892123679881739"
    },
    {
        "caption": "Our tasting room will be closed today (Thursday, Feb 18th) due to the ice and snow. But... insider info... we are bottling our 2020 Rosé up at the winery all day long. Coming Soon! \nFor now, enjoy the view of Quaker Run Vineyard and stay safe and warm. \n📷: @growinthatwine",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/151175870_2522559821374062_3594691903272034399_n.jpg?_nc_cat=104&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=IA5l5_WZhK4AX9hv6GU&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=e3066bf505e67966c340f597ba6d268f&oe=6069FE6E",
        "media_type": "IMAGE",
        "id": "17897137060795713"
    },
    {
        "caption": "❄️Fun Fact: Cold winter temperatures are important for growing healthy grapes. In the winter, the vines hibernate and cold temperatures help ensure that bud break, the start to the 2021 growing season, will be better timed for spring warmth. \n\n❄️This icy winter is protecting our buds from making their debut too soon, just one-of-many foundations for a bountiful harvest.\n\n❄️We also can’t help but note the natural beauty of our Virginia mountains alongside frosted vines.\n\nPhoto by @growinthatwine our vineyard manager.",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/150702873_185940173291157_488045092410862686_n.jpg?_nc_cat=107&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=jU6Y2wRu-I0AX_nDv-p&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=1374575e0618cfe3670f617734d37a3a&oe=606BF04C",
        "media_type": "IMAGE",
        "id": "17889004717911007"
    },
    {
        "caption": "The scenic rolling hills of our vineyard are the perfect backdrop for a romantic evening for you and your Valentine to share. There’s no better way to celebrate the most romantic day of the year than giving the gift of a beautiful sunset view and your choice among an exquisite array of wine flights.\n \nThis year, we’re offering a limited menu, extended hours, and live music to make the night extra special. \n \nReservations are going fast, so make sure you book soon. Follow this link to secure a table for you and your date: https://www.exploretock.com/earlymountainwinery/ \n\n📷: @kategreerphoto",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/148917722_789928244938224_3643577931389693149_n.jpg?_nc_cat=111&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=nhwEjUIos5YAX9OoNOB&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=573ac9fcb3ffc1857eef8ed5294b5b09&oe=606B3C8E",
        "media_type": "IMAGE",
        "id": "17925381061511802"
    },
    {
        "caption": "It's another Snow Day Sunday... the Early Mountain tasting room will be closed today. Stay safe and cozy and we look forward to welcoming you soon.",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/146653015_761053088140542_196234325470388249_n.jpg?_nc_cat=102&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=uuZUAh0_yRQAX_ecT9T&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=8108896b1191b60f635759165f968dd1&oe=6069B955",
        "media_type": "IMAGE",
        "id": "17881470851093516"
    },
    {
        "caption": "Valentine’s Day is just around the corner, and we have so many ways to celebrate.\n\nFirst up is our Local Love Gift Pack with our 2017 Estate Sparkling Brut, 2019 Foothills, two stemless sparkling glasses, and two flavors of local Charlottesville favorite @gearhartschocolates to pair. Whether you’re planning your night-in with your partner or sending some love to someone farther away, this is the perfect Valentine’s Day gift. \n\nFor those close enough to visit the vineyard, we’ll have extended hours Valentine’s Day weekend (2/12-2/14) with a special menu all weekend: oysters, caviar and blinis, white truffle risotto, and cocoa & chili roasted beef tenderloin, just to name a few. Tables are booking up quickly, reserve yours today. \n\n📷: @foodphotographer",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/144500141_238297244582200_7397759470581705993_n.jpg?_nc_cat=104&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=osxdAmv-BrwAX_MpomV&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=eb3e817280932c4cec8be48ac8d1378b&oe=606B4C45",
        "media_type": "IMAGE",
        "id": "17899886269745826"
    },
    {
        "caption": "Raise your hand if you’ve had a Petit Manseng-sized hole in your heart since we sold out of the 2018 vintage last year? Us too. Well, we have great news. The 2019 is here! \n\nA little background for those who might not know this grape or who haven’t tried this wine yet (you’re in for a treat):\n\n🍇 Petit Manseng thrives in Virginia and is perfectly suited to our clay soils and humid climate\n\n🍇 This is a wine of texture, structure, and intensity, perfect for these winter months.\n\n🍇 The 2019 vintage has a juicy acidity with tropical notes balanced by the creaminess produced by long aging. It is truly a flavor explosion.\n\nWhether you’ve been tasting evolving Petit Manseng vintages over the years or this is your first time trying this wine, we know you will love it. Order yours today.\n\n📷: @foodphotographer\n\n#petitmanseng #oenophile #sommelier #VAwine #newrelease #viticulture #vinification #2019vintage #winterwine #visitva",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/143984637_336206794201823_2087161638167519846_n.jpg?_nc_cat=110&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=WYRkELT0n9cAX-ugyQY&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=0eba808692b885b8589d470aa3c73db3&oe=606CDF8A",
        "media_type": "IMAGE",
        "id": "17888743453938700"
    },
    {
        "caption": "We are honored to share this glowing write-up of our accomplished culinary team from the @distinction_magazine article ’The Climber Chef Tim Moore.’ \n\n“Menus change with the seasons and feature a sophisticated blend of approachable hors d’oeuvres, shared plates, mains and sweets. More than 90 percent of meats, cheeses and produce are sourced from regional artisans. Familiar dishes are given the fine-dining treatment and cater to specific wine pairings.\n\nTake, for example, Moore’s show-stopping pork chop. A milk-fed piglet tenderloin from Whippoorwill Farms is served in a pool of dark, bourbon-apple veal demi-glace over an autumnal medley of heirloom red cabbage, roasted sweet potatoes, shallots and winter squash. It’s topped with a lovely stack of pan-seared heritage apples, chopped bacon and a garnish of edible flowers. The plate arrives with a glass of 2017 Rise.”\n\nWe are proud of the expertise and creativity of our culinary team, led by Executive Chef Tim and our Chef de Cuisine, Kristen Hall. We’re excited as always to share our table with you.\n\nReserve your table via the link in our bio.\n\n📷: @adamewing",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/142912101_234938531518315_7110307161553009594_n.jpg?_nc_cat=109&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=Rbe8TKXksmcAX-TZIjQ&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=31a6bff6c1df5eef71ea603f7a8340f9&oe=60695C7A",
        "media_type": "IMAGE",
        "id": "17860293287388013"
    },
    {
        "caption": "GREAT NEWS! Our entire tasting room staff has been tested (via PCR tests) and we are back OPEN Sunday, January 24th (11 am - 5 pm) with our full wine offerings and a limited food menu.  Reservations are available via the link in our bio for indoor or outdoor tables. \nToday, we have curbside pick up until 5 pm and our online shop is open 24 hours a day. \nThank you for your support and patience as we continue to be extremely cautious and vigilant. \n\nOut of an abundance of caution, the Early Mountain tasting room will be closed as of Thursday January 21st due to a single incident of Covid exposure amongst our team. While the exposure occurred away from the winery, we continue to take the health and safety of our team and community extremely seriously and will reopen after our staff is fully tested and we can assure the safety of our guests.\n \nWe appreciate your understanding and support. In the meantime, our Early Mountain wines continue to be available through our online shop and we look forward to seeing you soon.",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/140025020_729124311074053_563395503632047249_n.jpg?_nc_cat=106&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=2rdGrzq9gHYAX9rcIYP&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=f83495475bc7345dc5453a6b968ea74c&oe=606CA8AD",
        "media_type": "IMAGE",
        "id": "17909664610613407"
    },
    {
        "caption": "Our winemaking philosophy has deep roots in history, responsible growing practices, and allowing our fruit to express its best self. While we love gleaning inspiration from classic winemaking regions around the world, we are constantly learning more and understanding our sites, establishing new paths for Virginia Wine.\n\nEvery glass of Early Mountain wine is the product of years of testing, learning, and dedication. We’re so happy to share our craft with you.\n\nImage throwback to #harvest2019\n📷: @kategreerphoto",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/135919214_511279453181232_583473657919010451_n.jpg?_nc_cat=102&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=ntBrm8ywGncAX9j20YK&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=01d59ca50e949dcc55f9d03c5cf94100&oe=606C1927",
        "media_type": "IMAGE",
        "id": "17931953935466630"
    },
    {
        "caption": "Whether your resolution is to cook more, eat healthier, or learn a new hobby, Early Mountain is here to help you start the new year on the right track. \n\nWe have a pairing for your most daring dishes and a wide array of scrumptious wine for everyone in your new book club. Order now and start your 2021 off on the right foot!",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/135300286_2122165201254426_2956054159277021807_n.jpg?_nc_cat=104&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=P-FPWJgZRcAAX87Srg9&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=62a7d8f8a8010c61a06d15ae99bb940b&oe=60697D29",
        "media_type": "IMAGE",
        "id": "17886767197931969"
    },
    {
        "caption": "Happy New Year to you and yours! We’re planning on opening our newest release, the 2017 Estate Brut, tomorrow to watch the ball drop. And you?\n \nWe’d love to celebrate with you from afar, or welcome you to celebrate at the Vineyard. We’ll be open from 11am-5pm both New Year’s Eve and Day.\n\n📷: @foodphotographer",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/134568896_3602755936476263_6771987766405986523_n.jpg?_nc_cat=105&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=BS3V2CjSNSsAX-2_m95&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=f9fbf3c112597ef1dbe20095b2298f87&oe=6069BB35",
        "media_type": "IMAGE",
        "id": "17851327322462814"
    },
    {
        "caption": "‘Tis the season to raise our glasses, happy holidays from Early Mountain! We are so thankful for your love and support this challenging year, and we hope we are able to give back and add to your holiday cheer this season. What bottle of wine are you opening this evening?",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/132207641_216052963417492_921657758303373968_n.jpg?_nc_cat=101&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=koNup9ZJhZgAX9W9PwN&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=e0b4b455ddf90326538157423740daf7&oe=606B6B30",
        "media_type": "IMAGE",
        "id": "18023323255294913"
    },
    {
        "caption": "Haven’t found the perfect holiday gift? Our gift cards are the perfect option. Leave the stress of shipping delays behind, and give a digital gift card to the wine lover in your life!\n\nFollow the link in our bio to order your gift today.",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/132027944_227524019033526_8967801908787109271_n.jpg?_nc_cat=105&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=TkJSDVboJSIAX9QwLTA&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=f5d3911768492186a2c220d36838291a&oe=606BFF3C",
        "media_type": "IMAGE",
        "id": "18089203021216148"
    },
    {
        "caption": "A bottle (or 3) of the 2017 Rise is the perfect gift for the wine aficionados in your life. Crafted from hand picked mountainside grapes, this extraordinary wine completes every holiday setting.\n\nGift the delectable 2017 Rise for those you love (and we won’t tell if you keep it all to yourself). Order yours today online or in our tasting room.",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/131240688_375144470443987_3603351527351959194_n.jpg?_nc_cat=108&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=MKssBLmcZjUAX9QlPDV&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=75b6fcc7549db461273c48feb145315f&oe=606CF4FD",
        "media_type": "IMAGE",
        "id": "17863791191274877"
    },
    {
        "caption": "For those of you interested in the wineries and bottles both pushing the envelope and driving quality in Virginia, our newest Taste of Virginia wine club is perfect for you! Rather than committing to one winery, you will gain access to some of the hardest to find gems from throughout the commonwealth.\n\nEach wine will be small batch, often side projects from some of your favorite winemakers, and usually the wines that sell out before you can grab them.\n\nMake sure you sign up for the Taste of Virginia Club soon for a taste of these delicious and unique wines. We’re already over 50% full for 2021. Learn more about this amazing opportunity via the link in our bio.",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/131309203_376121216824350_1363355728905208030_n.jpg?_nc_cat=100&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=uVSmYdSi3SMAX83fWIW&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=4ae557753a82d9ab39c22a3b2dd8e694&oe=606A61D3",
        "media_type": "IMAGE",
        "id": "17855857373346943"
    },
    {
        "caption": "In our 2020 gift guide, you can find the perfect holiday presents for your friends and family. From a beautiful sparkling brut to a rich fruity red, our wine selection has the perfect bottle or gift trio for every loved one. \n\nThis holiday season we are also offering gift cards for our spectacular tasting room. Give the gift of a beautiful experience at Early Mountain. \n\nFind your perfect gift here: https://EarlyMountain.dcatalog.com/v/Holiday-2020-First/",
        "media_url": "https://scontent-ort2-1.cdninstagram.com/v/t51.29350-15/129771998_663491184320242_7178287067733463057_n.jpg?_nc_cat=105&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=gTVsUMWyMewAX8agSL9&_nc_ht=scontent-ort2-1.cdninstagram.com&oh=fa8a748c6f295adb8d26be388c312a32&oe=606BB52A",
        "media_type": "IMAGE",
        "id": "17885452429891187"
    }
]