[
    {
        "caption": "Does your Monday look this happy? ⁠\nThis cutie is here to remind you that at Early Mountain, Monday is just as fun. Keep your weekend going, Thursday - Monday!⁠\n⁠\nNEW HOURS ⁠\nThursday - Monday 11-6 🍷 🍇 ⁠\n⁠\n📷 @sailorthegoldendood⁠\n⁠",
        "media_url": "https://scontent-iad3-1.cdninstagram.com/v/t51.2885-15/174607629_2955675034713606_3317549420204204678_n.jpg?_nc_cat=108&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=RWs9s1Z6lvYAX_Khqmv&_nc_ht=scontent-iad3-1.cdninstagram.com&oh=fae00980de32aa72c8a1e315aaae2329&oe=60AF3A67",
        "media_type": "IMAGE",
        "id": "17857085468524698"
    },
    {
        "caption": "NEW RELEASE Pet Nat ✨ ⁠\n⁠\nOur Pet Nat started out as a small side project and pure curiosity. The natural sparkling method is the oldest way of making sparkling wine, and is the result of a single, continuous fermentation. Short for 'pétillant naturel' meaning 'natural sparkling' this wine is a fresh and exciting take on the traditional sparkling method.⁠\n⁠\nAromas of honeysuckle, clementine, grapefruit and peach are⁠ highlighted by notes of tropical hops and fine refined bubbles. ⁠\n⁠.⁠\n.⁠\n.⁠\n✨ Shop link in bio! ✨",
        "media_url": "https://scontent-iad3-1.cdninstagram.com/v/t51.2885-15/172757305_3894262084024760_593680979811859787_n.jpg?_nc_cat=105&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=5AX8G2FXoKkAX9xN8du&_nc_ht=scontent-iad3-1.cdninstagram.com&oh=98663faf3208ccc4b3fe9d5805476b76&oe=60AD15D4",
        "media_type": "IMAGE",
        "id": "17885524094153652"
    },
    {
        "caption": "We want to say a special thanks to Big Island Aquaculture for providing our guests with the most delicious, sustainably grown oysters at our annual Oyster pop-up bar this spring. ⁠\n⁠\n⁠Freshly shucked oysters, Early Mountain wine, and Chef Tim Moore's delicious seafood specials made for the perfect weekend.⁠\n⁠\nIs it too soon to say we can't wait to do it again this October? ⁠\n⁠\n@big_island_aquaculture_oysters ⁠🦪 🥂",
        "media_url": "https://scontent-iad3-1.cdninstagram.com/v/t51.2885-15/170483071_2883892361931449_8474407215918255803_n.jpg?_nc_cat=107&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=xi5W9jfz8OkAX98DYO0&_nc_ht=scontent-iad3-1.cdninstagram.com&oh=645b2048addc4aa9dbeeb8e1f2684d29&oe=60AD447A",
        "media_type": "IMAGE",
        "id": "17873357882345990"
    },
    {
        "caption": "We love hearing our guests rave about the Early Mountain experience! @bordeauxwithbae you have us blushing. 🍷 ⁠\n⁠\n\"One of the things Bae and I love most is introducing our friends to wineries they’ve never been to before. Last weekend, we got the chance to take two of our favorite people in the world to one of the best places in the world, @earlymountain. The views, the wines, and the food (oh my God, THE FOOD) was impeccable. They even made a Chardonnay lover out of @mohumm14\" -@bordeauxwithbae⁠\n⁠",
        "media_url": "https://scontent-iad3-1.cdninstagram.com/v/t51.2885-15/171800669_502853744072225_6073175024930189107_n.jpg?_nc_cat=100&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=jcVHWn8t9XwAX-7Qro-&_nc_ht=scontent-iad3-1.cdninstagram.com&oh=f61cb8d98559686096982891f81ff7e5&oe=60AE837F",
        "media_type": "IMAGE",
        "id": "17885141798169126"
    },
    {
        "caption": "Our all-star hospitality and Wine Club manager Shawn Lawrence is headed to take on a new venture as the Assistant General Manager of The Golden Owl Tavern in Charlotte, NC.⁠\n⁠\nWe're immensely grateful for all the contributions Shawn has made during his time here. We will miss his dedication to our club members, willingness to jump into the kitchen as needed, expert baking, professional wine service, leadership, and good humor. It goes without say we will also miss his trusty sidekick Maddie. ;-)⁠\n⁠\nDouble tap to join us in wishing Shawn all the best on his next venture! 🥂",
        "media_url": "https://scontent-iad3-1.cdninstagram.com/v/t51.2885-15/169966108_278814817129460_1519858585686348944_n.jpg?_nc_cat=104&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=mFmfkvgcmBAAX8OdTyb&_nc_ht=scontent-iad3-1.cdninstagram.com&oh=78f95f7b9b3a6dd35c867412e3a797e4&oe=60AD9D35",
        "media_type": "IMAGE",
        "id": "17873885735285692"
    },
    {
        "caption": "Have you heard? Our Taste of Virginia Wine Club is here! We have currently reached the maximum members for this particular wine club release, however, it's not too soon to get on the list for the next one! ⁠\n⁠\nThe Taste of Virginia Wine Club is made up of small batch Virginia wines- you know, the ones that sell out before you can grab them!⁠\n⁠\nMany are side projects from some of your favorite winemakers, and have limited availability to the public. All will be hand selected and unique! Please note, there is limited member availability. The Club includes exclusive events and access to limited production wines. Two releases per year (April and October), 6 unique bottles each release. ⁠\n⁠\nLet us know at TOV@earlymountain.com if you'd like to join the list - you'll be first to know when new slots open!⁠\n⁠\n@invono @joytingwine @RAHwine @walshfamilywine @stinsonvineyard",
        "media_url": "https://scontent-iad3-1.cdninstagram.com/v/t51.2885-15/169245727_797926227828177_2426832052221556328_n.jpg?_nc_cat=106&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=pdi0dcEJpxgAX9CHj1e&_nc_ht=scontent-iad3-1.cdninstagram.com&oh=5cbb3aad75674b60252bf93febcce505&oe=60ACA610",
        "media_type": "IMAGE",
        "id": "17902586884856434"
    },
    {
        "caption": "⁠We are excited to welcome you with our NEW Hours, starting Easter weekend! ⁠\n⁠\nWine and dine with us from Thursday - Monday from 11-6. ⁠\n⁠\nBe sure to make your reservations in advance for Easter weekend to enjoy our new spring menu and wine!⁠\nView the full menu and make your reservations now at www.earlymountain.com⁠.⁠\n⁠\nIndoor, Patio Seating and Picnic Grounds are open for reservations and walk-ins (pending weather), bring the kids, we have the Easter Baskets ready!⁠\n⁠\n@kategreerphoto @charlottesvillebertdad",
        "media_url": "https://scontent-iad3-1.cdninstagram.com/v/t51.2885-15/167271263_501866007487385_7027516388654723880_n.jpg?_nc_cat=109&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=SXRsRZcmsBgAX_Qu-Jk&_nc_oc=AQn8LcM7aV9fS-8je9DM4m_1SS4aWgEQViQmZXgWPDVbHOHO7RTewRLsTOzPSyhgETE&_nc_ht=scontent-iad3-1.cdninstagram.com&oh=bacbabbdef0c655f7bb06c30d5145aa1&oe=60AE1D21",
        "media_type": "IMAGE",
        "id": "18170722420114808"
    },
    {
        "caption": "Join the Early Mountain team! ⁠\nWe are looking for lovely, outgoing, and enthusiastic people to join our team...⁠\n⁠\nCOMMUNITY MANAGER-  Are you a motivated and results-focused individual? You may be the perfect fit for our Wine Club Community Manager! - See full job description and apply! ⁠\n⁠\nTASTING ROOM ASSOCIATES- Do you have a passion for wine, food and people? You could be our next Tasting Room associate, apply today and join our team! ⁠\n⁠\nIf you love Virginia wine and working with amazing people be sure to check out all of our current career openings by visiting www.earlymountain.com/careers. ⁠",
        "media_url": "https://scontent-iad3-1.cdninstagram.com/v/t51.2885-15/166985763_1745798112247387_7019438289005392569_n.jpg?_nc_cat=108&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=qFHwI1vp_nQAX9k4_zh&_nc_oc=AQk3LMh5JPBWPoJTT3lOYFRHQRzuuYc3r6r4OQVHbIv9A-lAD5GniVgx9mS0Zxgx1U0&_nc_ht=scontent-iad3-1.cdninstagram.com&oh=755123874d008a50b267af837ec7fefa&oe=60AC9ED6",
        "media_type": "IMAGE",
        "id": "17890138676067247"
    },
    {
        "caption": "🍇ICYMI: To celebrate #OpenVAWine Day, our winemaker Ben Jordan is joining a virtual tasting this evening at 5pm (get your Petit Manseng chilling). It’s not too late to register—head to the link in our bio to join us. 🍇\n\nUnderstanding the Virginia sun, rain, and soil is the foundation of what we create. Our vineyard is Virginia through and through, and we’re so honored to be able to provide the bounty of Virginia Wine Country to you wherever you are. #DrinkVAWine",
        "media_url": "https://scontent-iad3-1.cdninstagram.com/v/t51.29350-15/165458441_726693191571023_2634152374147333182_n.jpg?_nc_cat=108&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=3vlwecASs3IAX-oPCxG&_nc_ht=scontent-iad3-1.cdninstagram.com&oh=6e5e5eac5b429a9ccdd4c0ecc9177475&oe=60AD8C02",
        "media_type": "IMAGE",
        "id": "17899720849825292"
    },
    {
        "caption": "From Thursday, March 25th - Sunday, March 28th, we’re offering guests the bounty of the Eastern Seaboard, featuring @big_island_aquaculture_oysters oysters paired with our award-winning wines.\n\nIn addition to our full Tasting Room menu, Chef Tim Moore will be offering delicious seafood specials. Big Island Aquaculture will be shucking their sustainably grown oysters, served on the half shell direct from the beautiful, pristine body of water nestled between the York River and the Mobjack Bay in Hayes, Virginia, pictured here. \n\nIf you make your reservation for Saturday or Sunday, we’ll have live music in addition to mountain views, and exceptional Virginia wines. You can reserve space in our indoor tasting room, or take in the outdoor air on our patio. \n\nDon’t worry if you can’t make it in person. On Thursday March, 18th, we’re hosting a virtual tasting with guests with wine and oyster expertise: Bruce and Daniel Vogt of Big Island Aquaculture, Barboursville’s Luca Pascina, Chatham Vineyard’s Jon Wehner and Early Mountain’s winemaker, Ben Jordan.\n\nMake your reservation for the in person event here: https://www.exploretock.com/earlymountainwinery/",
        "media_url": "https://scontent-iad3-1.cdninstagram.com/v/t51.29350-15/159980336_282922010119159_5586384850066630034_n.jpg?_nc_cat=107&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=K22dAZOAmRkAX80ulUW&_nc_ht=scontent-iad3-1.cdninstagram.com&oh=7cc57b92ec90c1ed8c3b889ecf00876f&oe=60ACF797",
        "media_type": "IMAGE",
        "id": "17892085531968961"
    },
    {
        "caption": "Four Early Mountain wines (+associate winemaker Maya Hood White’s side hustle R.A.H.) were selected from the almost 600 entries from 100 Virginia Wineries in the 2021 Virginia Governor’s Cup Case competition! \n\nTo receive their gold medals (scores between 90 and 100), our entries were evaluated on their appearance, aroma, flavor, overall quality, and commercial suitability and were deemed “outstanding” or “classic” by the expert judges.    \n\nEarly Mountain’s 2021 Winners are:\n\n2019 Five Forks\n2017 Eluvium\n2019 Capstone Vineyard Cabernet Franc\n2019 Shenandoah Valley Cabernet Franc\n2017 R.A.H. \n\nYou can order the Gold Medal Pack today and sample our 2021 Governor’s Cup Competition Winners: https://store.earlymountain.com/",
        "media_url": "https://scontent-iad3-1.cdninstagram.com/v/t51.29350-15/156661773_105000218228829_1912693434187313379_n.jpg?_nc_cat=108&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=tQdzIbZGDo4AX94xuIC&_nc_ht=scontent-iad3-1.cdninstagram.com&oh=d4469ed632e2f2d16f9748598a07dda5&oe=60B05DF3",
        "media_type": "IMAGE",
        "id": "17867645393351882"
    },
    {
        "caption": "Our newest release, the 2020 Rosé, was made for warm sun-filled days, offering bright aromas of strawberries, white peaches, red grapefruit. It’s light on its feet, but has a delicate intensity that lingers.\n\nWhether you want to debut all the complexities of this vintage with friends or enjoy a glass after a long day, this wine is perfect for you.",
        "media_url": "https://scontent-iad3-1.cdninstagram.com/v/t51.29350-15/151017772_443162943774513_3606608092028385554_n.jpg?_nc_cat=111&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=0l-FTFTtoo0AX9cObEa&_nc_ht=scontent-iad3-1.cdninstagram.com&oh=e6f07766c77868d0eb422b4071e3a556&oe=60AE5210",
        "media_type": "IMAGE",
        "id": "17879134220160188"
    },
    {
        "caption": "If you needed some good news today, here it is: rosé season has officially arrived!\n\nThe brightness, lightness, and silky texture of the 2020 Rosé release is the perfect way to treat yourself after these ice-filled days. Come visit the vineyard and enjoy a sip in the sun, or order your own bottle of sunshine (aka rosé) online today.",
        "media_url": "https://scontent-iad3-1.cdninstagram.com/v/t51.29350-15/152874601_169403071476818_6502484982130685785_n.jpg?_nc_cat=109&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=7wIhM-Y4WD0AX8CwMnZ&_nc_ht=scontent-iad3-1.cdninstagram.com&oh=65ab07c6e9c5f8f816a240dfd78efd42&oe=60AFA94A",
        "media_type": "IMAGE",
        "id": "17892123679881739"
    },
    {
        "caption": "Our tasting room will be closed today (Thursday, Feb 18th) due to the ice and snow. But... insider info... we are bottling our 2020 Rosé up at the winery all day long. Coming Soon! \nFor now, enjoy the view of Quaker Run Vineyard and stay safe and warm. \n📷: @growinthatwine",
        "media_url": "https://scontent-iad3-1.cdninstagram.com/v/t51.29350-15/151175870_2522559821374062_3594691903272034399_n.jpg?_nc_cat=104&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=7dkHHYFojpAAX-vWWnz&_nc_ht=scontent-iad3-1.cdninstagram.com&oh=7d3bb4295ff79cec3a6e7c72d404e35b&oe=60AD3AEE",
        "media_type": "IMAGE",
        "id": "17897137060795713"
    },
    {
        "caption": "❄️Fun Fact: Cold winter temperatures are important for growing healthy grapes. In the winter, the vines hibernate and cold temperatures help ensure that bud break, the start to the 2021 growing season, will be better timed for spring warmth. \n\n❄️This icy winter is protecting our buds from making their debut too soon, just one-of-many foundations for a bountiful harvest.\n\n❄️We also can’t help but note the natural beauty of our Virginia mountains alongside frosted vines.\n\nPhoto by @growinthatwine our vineyard manager.",
        "media_url": "https://scontent-iad3-1.cdninstagram.com/v/t51.29350-15/150702873_185940173291157_488045092410862686_n.jpg?_nc_cat=107&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=MbocDGGC4WcAX-5GBXG&_nc_ht=scontent-iad3-1.cdninstagram.com&oh=3ed8570c598c6177450b0adc3d1271df&oe=60AF2CCC",
        "media_type": "IMAGE",
        "id": "17889004717911007"
    },
    {
        "caption": "The scenic rolling hills of our vineyard are the perfect backdrop for a romantic evening for you and your Valentine to share. There’s no better way to celebrate the most romantic day of the year than giving the gift of a beautiful sunset view and your choice among an exquisite array of wine flights.\n \nThis year, we’re offering a limited menu, extended hours, and live music to make the night extra special. \n \nReservations are going fast, so make sure you book soon. Follow this link to secure a table for you and your date: https://www.exploretock.com/earlymountainwinery/ \n\n📷: @kategreerphoto",
        "media_url": "https://scontent-iad3-1.cdninstagram.com/v/t51.29350-15/148917722_789928244938224_3643577931389693149_n.jpg?_nc_cat=111&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=FIusPdk4l9EAX-qPkt8&_nc_ht=scontent-iad3-1.cdninstagram.com&oh=421f3f63c0654cf9be87027328eb0832&oe=60AE790E",
        "media_type": "IMAGE",
        "id": "17925381061511802"
    },
    {
        "caption": "It's another Snow Day Sunday... the Early Mountain tasting room will be closed today. Stay safe and cozy and we look forward to welcoming you soon.",
        "media_url": "https://scontent-iad3-1.cdninstagram.com/v/t51.29350-15/146653015_761053088140542_196234325470388249_n.jpg?_nc_cat=102&ccb=1-3&_nc_sid=8ae9d6&_nc_ohc=2NAh4ILvcHkAX_TNybe&_nc_ht=scontent-iad3-1.cdninstagram.com&oh=ddbb9dfa82534029d1a2fd405d50d0b6&oe=60ACF5D5",
        "media_type": "IMAGE",
        "id": "17881470851093516"
    }
]