[
    {
        "caption": "It's another Snow Day Sunday... the Early Mountain tasting room will be closed today. Stay safe and cozy and we look forward to welcoming you soon.",
        "media_url": "https://scontent-sjc3-1.cdninstagram.com/v/t51.29350-15/146653015_761053088140542_196234325470388249_n.jpg?_nc_cat=102&ccb=2&_nc_sid=8ae9d6&_nc_ohc=st7xoDPXBFkAX_vTnPU&_nc_ht=scontent-sjc3-1.cdninstagram.com&oh=da1b38c8d06fc53f7094689e5adcfefe&oe=604620D5",
        "media_type": "IMAGE",
        "id": "17881470851093516"
    },
    {
        "caption": "The Early Mountain tasting room is closed today, Jan 31st. Enjoy a safe and cozy snow day!",
        "media_url": "https://scontent-sjc3-1.cdninstagram.com/v/t51.29350-15/144086332_169769391583485_4725073790591836598_n.jpg?_nc_cat=104&ccb=2&_nc_sid=8ae9d6&_nc_ohc=lZDEm5X7qSgAX8-dniu&_nc_ht=scontent-sjc3-1.cdninstagram.com&oh=f1b203059c22e5c090442d691e6393aa&oe=6046F0E8",
        "media_type": "IMAGE",
        "id": "17884727278969661"
    },
    {
        "caption": "Valentine’s Day is just around the corner, and we have so many ways to celebrate.\n\nFirst up is our Local Love Gift Pack with our 2017 Estate Sparkling Brut, 2019 Foothills, two stemless sparkling glasses, and two flavors of local Charlottesville favorite @gearhartschocolates to pair. Whether you’re planning your night-in with your partner or sending some love to someone farther away, this is the perfect Valentine’s Day gift. \n\nFor those close enough to visit the vineyard, we’ll have extended hours Valentine’s Day weekend (2/12-2/14) with a special menu all weekend: oysters, caviar and blinis, white truffle risotto, and cocoa & chili roasted beef tenderloin, just to name a few. Tables are booking up quickly, reserve yours today. \n\n📷: @foodphotographer",
        "media_url": "https://scontent-sjc3-1.cdninstagram.com/v/t51.29350-15/144500141_238297244582200_7397759470581705993_n.jpg?_nc_cat=104&ccb=2&_nc_sid=8ae9d6&_nc_ohc=aK8o_v0P1CAAX-NqXsb&_nc_ht=scontent-sjc3-1.cdninstagram.com&oh=a56460cf24b74c624eb0c2553e3191f0&oe=6047B3C5",
        "media_type": "IMAGE",
        "id": "17899886269745826"
    },
    {
        "caption": "Raise your hand if you’ve had a Petit Manseng-sized hole in your heart since we sold out of the 2018 vintage last year? Us too. Well, we have great news. The 2019 is here! \n\nA little background for those who might not know this grape or who haven’t tried this wine yet (you’re in for a treat):\n\n🍇 Petit Manseng thrives in Virginia and is perfectly suited to our clay soils and humid climate\n\n🍇 This is a wine of texture, structure, and intensity, perfect for these winter months.\n\n🍇 The 2019 vintage has a juicy acidity with tropical notes balanced by the creaminess produced by long aging. It is truly a flavor explosion.\n\nWhether you’ve been tasting evolving Petit Manseng vintages over the years or this is your first time trying this wine, we know you will love it. Order yours today.\n\n📷: @foodphotographer\n\n#petitmanseng #oenophile #sommelier #VAwine #newrelease #viticulture #vinification #2019vintage #winterwine #visitva",
        "media_url": "https://scontent-sjc3-1.cdninstagram.com/v/t51.29350-15/143984637_336206794201823_2087161638167519846_n.jpg?_nc_cat=110&ccb=2&_nc_sid=8ae9d6&_nc_ohc=66zDBcyR-wwAX87qzl-&_nc_ht=scontent-sjc3-1.cdninstagram.com&oh=30fa89f778801fcdd0455e0008110a8d&oe=6045528A",
        "media_type": "IMAGE",
        "id": "17888743453938700"
    },
    {
        "caption": "We are honored to share this glowing write-up of our accomplished culinary team from the @distinction_magazine article ’The Climber Chef Tim Moore.’ \n\n“Menus change with the seasons and feature a sophisticated blend of approachable hors d’oeuvres, shared plates, mains and sweets. More than 90 percent of meats, cheeses and produce are sourced from regional artisans. Familiar dishes are given the fine-dining treatment and cater to specific wine pairings.\n\nTake, for example, Moore’s show-stopping pork chop. A milk-fed piglet tenderloin from Whippoorwill Farms is served in a pool of dark, bourbon-apple veal demi-glace over an autumnal medley of heirloom red cabbage, roasted sweet potatoes, shallots and winter squash. It’s topped with a lovely stack of pan-seared heritage apples, chopped bacon and a garnish of edible flowers. The plate arrives with a glass of 2017 Rise.”\n\nWe are proud of the expertise and creativity of our culinary team, led by Executive Chef Tim and our Chef de Cuisine, Kristen Hall. We’re excited as always to share our table with you.\n\nReserve your table via the link in our bio.\n\n📷: @adamewing",
        "media_url": "https://scontent-sjc3-1.cdninstagram.com/v/t51.29350-15/142912101_234938531518315_7110307161553009594_n.jpg?_nc_cat=109&ccb=2&_nc_sid=8ae9d6&_nc_ohc=MnbXYFxPkVEAX_eNcm7&_nc_ht=scontent-sjc3-1.cdninstagram.com&oh=6d126096d6406e21c0c3b31c5236c297&oe=6045C3FA",
        "media_type": "IMAGE",
        "id": "17860293287388013"
    },
    {
        "caption": "GREAT NEWS! Our entire tasting room staff has been tested (via PCR tests) and we are back OPEN Sunday, January 24th (11 am - 5 pm) with our full wine offerings and a limited food menu.  Reservations are available via the link in our bio for indoor or outdoor tables. \nToday, we have curbside pick up until 5 pm and our online shop is open 24 hours a day. \nThank you for your support and patience as we continue to be extremely cautious and vigilant. \n\nOut of an abundance of caution, the Early Mountain tasting room will be closed as of Thursday January 21st due to a single incident of Covid exposure amongst our team. While the exposure occurred away from the winery, we continue to take the health and safety of our team and community extremely seriously and will reopen after our staff is fully tested and we can assure the safety of our guests.\n \nWe appreciate your understanding and support. In the meantime, our Early Mountain wines continue to be available through our online shop and we look forward to seeing you soon.",
        "media_url": "https://scontent-sjc3-1.cdninstagram.com/v/t51.29350-15/140025020_729124311074053_563395503632047249_n.jpg?_nc_cat=106&ccb=2&_nc_sid=8ae9d6&_nc_ohc=fU47uA6X5egAX8ubUVr&_nc_ht=scontent-sjc3-1.cdninstagram.com&oh=bc2c0ba7b2bd0bf05535363658b81bc4&oe=60451BAD",
        "media_type": "IMAGE",
        "id": "17909664610613407"
    },
    {
        "caption": "Our winemaking philosophy has deep roots in history, responsible growing practices, and allowing our fruit to express its best self. While we love gleaning inspiration from classic winemaking regions around the world, we are constantly learning more and understanding our sites, establishing new paths for Virginia Wine.\n\nEvery glass of Early Mountain wine is the product of years of testing, learning, and dedication. We’re so happy to share our craft with you.\n\nImage throwback to #harvest2019\n📷: @kategreerphoto",
        "media_url": "https://scontent-sjc3-1.cdninstagram.com/v/t51.29350-15/135919214_511279453181232_583473657919010451_n.jpg?_nc_cat=102&ccb=2&_nc_sid=8ae9d6&_nc_ohc=_Gi5GoCYKhsAX9H3EZq&_nc_ht=scontent-sjc3-1.cdninstagram.com&oh=3e8b811686294a576a39115f85f95442&oe=60448C27",
        "media_type": "IMAGE",
        "id": "17931953935466630"
    },
    {
        "caption": "Whether your resolution is to cook more, eat healthier, or learn a new hobby, Early Mountain is here to help you start the new year on the right track. \n\nWe have a pairing for your most daring dishes and a wide array of scrumptious wine for everyone in your new book club. Order now and start your 2021 off on the right foot!",
        "media_url": "https://scontent-sjc3-1.cdninstagram.com/v/t51.29350-15/135300286_2122165201254426_2956054159277021807_n.jpg?_nc_cat=104&ccb=2&_nc_sid=8ae9d6&_nc_ohc=rLYm9yd494AAX8dubXW&_nc_ht=scontent-sjc3-1.cdninstagram.com&oh=662b31e1b40f0d87006f0ffe911e964d&oe=6045E4A9",
        "media_type": "IMAGE",
        "id": "17886767197931969"
    },
    {
        "caption": "Happy New Year to you and yours! We’re planning on opening our newest release, the 2017 Estate Brut, tomorrow to watch the ball drop. And you?\n \nWe’d love to celebrate with you from afar, or welcome you to celebrate at the Vineyard. We’ll be open from 11am-5pm both New Year’s Eve and Day.\n\n📷: @foodphotographer",
        "media_url": "https://scontent-sjc3-1.cdninstagram.com/v/t51.29350-15/134568896_3602755936476263_6771987766405986523_n.jpg?_nc_cat=105&ccb=2&_nc_sid=8ae9d6&_nc_ohc=UOC-XsrcL1MAX9_ZYrG&_nc_ht=scontent-sjc3-1.cdninstagram.com&oh=7314d617d7e71e38b9bf07d30620815c&oe=604622B5",
        "media_type": "IMAGE",
        "id": "17851327322462814"
    },
    {
        "caption": "‘Tis the season to raise our glasses, happy holidays from Early Mountain! We are so thankful for your love and support this challenging year, and we hope we are able to give back and add to your holiday cheer this season. What bottle of wine are you opening this evening?",
        "media_url": "https://scontent-sjc3-1.cdninstagram.com/v/t51.29350-15/132207641_216052963417492_921657758303373968_n.jpg?_nc_cat=101&ccb=2&_nc_sid=8ae9d6&_nc_ohc=oG7tLa3psj0AX8SRhzQ&_nc_ht=scontent-sjc3-1.cdninstagram.com&oh=94c7e95326955e94b4139be2e36ffd88&oe=6047D2B0",
        "media_type": "IMAGE",
        "id": "18023323255294913"
    },
    {
        "caption": "Haven’t found the perfect holiday gift? Our gift cards are the perfect option. Leave the stress of shipping delays behind, and give a digital gift card to the wine lover in your life!\n\nFollow the link in our bio to order your gift today.",
        "media_url": "https://scontent-sjc3-1.cdninstagram.com/v/t51.29350-15/132027944_227524019033526_8967801908787109271_n.jpg?_nc_cat=105&ccb=2&_nc_sid=8ae9d6&_nc_ohc=DwrYsYCjQdcAX8d0K1X&_nc_ht=scontent-sjc3-1.cdninstagram.com&oh=789e1b6c55fd706b7222b254f5601465&oe=6044723C",
        "media_type": "IMAGE",
        "id": "18089203021216148"
    },
    {
        "caption": "A bottle (or 3) of the 2017 Rise is the perfect gift for the wine aficionados in your life. Crafted from hand picked mountainside grapes, this extraordinary wine completes every holiday setting.\n\nGift the delectable 2017 Rise for those you love (and we won’t tell if you keep it all to yourself). Order yours today online or in our tasting room.",
        "media_url": "https://scontent-sjc3-1.cdninstagram.com/v/t51.29350-15/131240688_375144470443987_3603351527351959194_n.jpg?_nc_cat=108&ccb=2&_nc_sid=8ae9d6&_nc_ohc=Jgqt1VBKcZcAX_vPi1P&_nc_ht=scontent-sjc3-1.cdninstagram.com&oh=af795e3187fb35f174bc8dd4b98b182c&oe=604567FD",
        "media_type": "IMAGE",
        "id": "17863791191274877"
    },
    {
        "caption": "For those of you interested in the wineries and bottles both pushing the envelope and driving quality in Virginia, our newest Taste of Virginia wine club is perfect for you! Rather than committing to one winery, you will gain access to some of the hardest to find gems from throughout the commonwealth.\n\nEach wine will be small batch, often side projects from some of your favorite winemakers, and usually the wines that sell out before you can grab them.\n\nMake sure you sign up for the Taste of Virginia Club soon for a taste of these delicious and unique wines. We’re already over 50% full for 2021. Learn more about this amazing opportunity via the link in our bio.",
        "media_url": "https://scontent-sjc3-1.cdninstagram.com/v/t51.29350-15/131309203_376121216824350_1363355728905208030_n.jpg?_nc_cat=100&ccb=2&_nc_sid=8ae9d6&_nc_ohc=p_APHweo3s8AX_CH3Pp&_nc_ht=scontent-sjc3-1.cdninstagram.com&oh=5b156671dc7d23d1f502e69d00e0466d&oe=6046C953",
        "media_type": "IMAGE",
        "id": "17855857373346943"
    },
    {
        "caption": "In our 2020 gift guide, you can find the perfect holiday presents for your friends and family. From a beautiful sparkling brut to a rich fruity red, our wine selection has the perfect bottle or gift trio for every loved one. \n\nThis holiday season we are also offering gift cards for our spectacular tasting room. Give the gift of a beautiful experience at Early Mountain. \n\nFind your perfect gift here: https://EarlyMountain.dcatalog.com/v/Holiday-2020-First/",
        "media_url": "https://scontent-sjc3-1.cdninstagram.com/v/t51.29350-15/129771998_663491184320242_7178287067733463057_n.jpg?_nc_cat=105&ccb=2&_nc_sid=8ae9d6&_nc_ohc=ZLCMyejwrfYAX-T7lO0&_nc_ht=scontent-sjc3-1.cdninstagram.com&oh=6f04fe09a5cb6ea41a28f8cf7407273c&oe=60481CAA",
        "media_type": "IMAGE",
        "id": "17885452429891187"
    },
    {
        "caption": "A #hashtagholiday we can support...Happy Cabernet Franc day, world!",
        "media_url": "https://scontent-sjc3-1.cdninstagram.com/v/t51.29350-15/129718319_138546317773467_6810280587646542037_n.jpg?_nc_cat=105&ccb=2&_nc_sid=8ae9d6&_nc_ohc=4N1kkpoVcXQAX9PkhSn&_nc_ht=scontent-sjc3-1.cdninstagram.com&oh=2f42d4a0bf0c43c98beba3103d1e7f62&oe=6044D70B",
        "media_type": "IMAGE",
        "id": "17956405870367091"
    },
    {
        "caption": "This holiday season, make sure your home is stocked with the best of the best. Complete your holiday selection with scrumptious wine pairings that are both accessible and exceptional.\n\nThis is your last chance to order your selection online, with pick up available through Wednesday, November 25th. We will be open again Friday through Sunday with special holiday fare and wine features. Happy Thanksgiving!\n\nPhoto credit: @ashley.p.cox\nTable setting: @bejustcville",
        "media_url": "https://scontent-sjc3-1.cdninstagram.com/v/t51.29350-15/126907297_1830977373707264_1303981051689304119_n.jpg?_nc_cat=100&ccb=2&_nc_sid=8ae9d6&_nc_ohc=4nZ0R15-gc8AX_R6I8-&_nc_ht=scontent-sjc3-1.cdninstagram.com&oh=e0287c1c9475ea457a85a216790bfbf7&oe=6045F7E0",
        "media_type": "IMAGE",
        "id": "17864614742148766"
    },
    {
        "caption": "Make your Thanksgiving holiday weekend special this year with a visit to the beautiful Early Mountain Vineyard. Our picturesque outdoor accommodations and elegant wine selection are the perfect combination for a relaxing retreat. \n\nYou can book your reservation through the link in our bio, and you’ll be here before you know it.",
        "media_url": "https://scontent-sjc3-1.cdninstagram.com/v/t51.29350-15/126079562_723222181966770_384053621398642863_n.jpg?_nc_cat=110&ccb=2&_nc_sid=8ae9d6&_nc_ohc=DXqk5w6Zz1QAX8sg1aj&_nc_ht=scontent-sjc3-1.cdninstagram.com&oh=6ed7c33bfb9c8bfc50ee9cc9af68a56b&oe=604740C5",
        "media_type": "IMAGE",
        "id": "17856120866304366"
    },
    {
        "caption": "@James.suckling reviewed Early Mountain Virginia 2017 Rise, awarding it 92 points! He described the powerful and aromatic red as “racy and energetic,” and the complex flavor profile as “Boysenberry and currant aromas with chocolate and cedar, following through to a medium to full body.” \n\nWe’re honored and excited to share one of our most beautiful wines with you. You can order the 2017 Early Mountain Virginia Rise, packed in custom wood boxes for single, three, or six bottle packs by following the link in our bio.",
        "media_url": "https://scontent-sjc3-1.cdninstagram.com/v/t51.29350-15/124254171_182917136746495_7605004920002841563_n.jpg?_nc_cat=110&ccb=2&_nc_sid=8ae9d6&_nc_ohc=Nf-up0lNBeAAX-NP3a0&_nc_ht=scontent-sjc3-1.cdninstagram.com&oh=6719dd3e571533750a535089107d0430&oe=604607D8",
        "media_type": "IMAGE",
        "id": "17866754186097187"
    },
    {
        "caption": "Join us in celebrating the joy of the holiday season with an elegant Bounty of Virginia Wine Dinner. Executive Chef Tim Moore has created a 5-course dinner paired with new releases and award-winning favorites, including our 2017 RISE and inaugural estate Sparkling release. Create merry memories of 2020 with this intimate and extraordinary dinner experience. \n\nThis season we’re doing things a little bit differently: rather than a communal wine dinner, all tables will be seated as separate parties. With each decadent course, our team will share the vision \"behind the scenes\" of our wines and the bounty we are so honored to elevate.\n\nYou don’t want to miss this incredible dining experience on 12/11 and 12/18 at our vineyard.",
        "media_url": "https://scontent-sjc3-1.cdninstagram.com/v/t51.29350-15/124003739_126859292279106_8542088097227729501_n.jpg?_nc_cat=104&ccb=2&_nc_sid=8ae9d6&_nc_ohc=AaDA27Zzr6oAX_73DgM&_nc_ht=scontent-sjc3-1.cdninstagram.com&oh=8989cbb74c9302f579eed8edd80ca73b&oe=604507B2",
        "media_type": "IMAGE",
        "id": "17902683739594174"
    }
]