[
    {
        "caption": "Time travel with us to 2017’s growing season, full of welcoming and accommodating weather. We were fortunate to avoid both spring frost and heavy rains in late-summer and fall. The days were perfectly warm while the nights were cool, allowing for our grapes to ripen while preserving their bursts of acidity. When the grapes were ready,  our team carefully handpicked each bunch. It was a magical season. #2017Release #ComingSoon\n\nPhoto: @katemgreer",
        "media_url": "https://scontent-dfw5-1.cdninstagram.com/v/t51.29350-15/117702557_192147772273777_465701865692520139_n.jpg?_nc_cat=103&_nc_sid=8ae9d6&_nc_ohc=pzCffUV0c_cAX-wcp5X&_nc_ht=scontent-dfw5-1.cdninstagram.com&oh=14c42857f463481496bed4672531249c&oe=5F603E16",
        "media_type": "IMAGE",
        "id": "17867130409980181"
    },
    {
        "caption": "Join us (virtually) on Aug 19th at 7 pm to talk with Ben Jordan (Early Mountain's winemaker) and Justin Rose (@rosemontvineyards winemaker) for an exploration of Hybrid grape varieties and their role in Virginia wine's past, present, and future. \n\nBen and Justin are both enthusiastic about the potential for hybrids in Virginia; they can be farmed with a lighter touch and can successfully weather some of the challenges of a changing climate. We'll taste three of the most planted varieties and explore their range from sparkling to white, rosé and red wines. \n\nThe pack will include: \nRosemont Extra Brut Sparkling (Chardonel)\nEarly Mountain Young Wine White 2019 (Vidal Blanc)\nRosemont Rosé 2019 (Chambourcin) \nEarly Mountain Young Wine Red 2019 (Chambourcin)\n\nGrab the bundle from our online shop (link in Bio) to taste along or pop your favorite beverage and listen in. \n\nWe will be combining with Rosemont's \"Winemaker Wednesday\" and the tasting can be viewed on either of our Facebook Pages.",
        "media_url": "https://scontent-dfw5-1.cdninstagram.com/v/t51.29350-15/117528824_727884594443915_3868341424815974872_n.jpg?_nc_cat=105&_nc_sid=8ae9d6&_nc_ohc=EBP6k3aioUsAX8n0tgI&_nc_ht=scontent-dfw5-1.cdninstagram.com&oh=77079119de579ead7f326aaadf2b3505&oe=5F63EB18",
        "media_type": "IMAGE",
        "id": "17852571956195259"
    },
    {
        "caption": "Low-tannin and fruit-forward, the 2019 Young Wine Red is our no-fuss answer to these scorching summer days. Check out our chillable reds on our online store in our ultimate Summer Sipper pack, or reserve a table and sip them here at Early Mountain.",
        "media_url": "https://scontent-dfw5-1.cdninstagram.com/v/t51.29350-15/110025727_304895780662662_6498387998057878334_n.jpg?_nc_cat=111&_nc_sid=8ae9d6&_nc_ohc=PuMqRRe2GZsAX8Exvoq&_nc_ht=scontent-dfw5-1.cdninstagram.com&oh=709c9b62bea4291b8d81ab9f737b8589&oe=5F61C019",
        "media_type": "IMAGE",
        "id": "17882993665668942"
    },
    {
        "caption": "Take in the views and listen to the live tunes on our back lawn. We have live music every Saturday and Sunday to complement every sip. Reserve a table now through the link in our bio.\n\nPhoto: Ryan Pierce",
        "media_url": "https://scontent-dfw5-1.cdninstagram.com/v/t51.29350-15/106927440_670181106870787_7790454056691331599_n.jpg?_nc_cat=101&_nc_sid=8ae9d6&_nc_ohc=fjaeHaaGY4YAX9tKvXh&_nc_ht=scontent-dfw5-1.cdninstagram.com&oh=8f433c5412f336f7e087765ebfdfdfe4&oe=5F619466",
        "media_type": "IMAGE",
        "id": "17847929057201372"
    },
    {
        "caption": "Celebrate summer with our 2019 Five Forks! With Petit Manseng in the spotlight and Sauvignon Blanc vamping in a supporting role, this evolution is anything but subdued. It just might be our favorite vintage yet.",
        "media_url": "https://scontent-dfw5-2.cdninstagram.com/v/t51.29350-15/106587218_315143913211416_6129703101121735224_n.jpg?_nc_cat=104&_nc_sid=8ae9d6&_nc_ohc=BswRzcVv2o8AX9RdGmu&_nc_ht=scontent-dfw5-2.cdninstagram.com&oh=33f3d58ef87e52bc6affba997112707c&oe=5F635C23",
        "media_type": "IMAGE",
        "id": "17940631135366151"
    },
    {
        "caption": "We have all your wine needs solved for this long weekend and beyond! Pick up a quartet or case of our Summer Sippers: new releases perfect for your patio, poolside, or backyard BBQ. Visit our online shop for special pricing throughout July. \n\nLink in bio to shop.",
        "media_url": "https://scontent-dfw5-2.cdninstagram.com/v/t51.29350-15/82964020_715135035953355_476499285030756567_n.jpg?_nc_cat=109&_nc_sid=8ae9d6&_nc_ohc=-Yhm3BIhSiEAX__1wQZ&_nc_ht=scontent-dfw5-2.cdninstagram.com&oh=15add89eb692a6aa4b118139b09875d2&oe=5F615488",
        "media_type": "IMAGE",
        "id": "17864328889903616"
    },
    {
        "caption": "They’re back! Tasting Flights will be offered again in our Tasting Room and Patio starting Friday. We love presenting delicious #vawine from our favorite wineries together with Early Mountain offerings. \nWe’ll have rotating offerings, but are kicking things off with 4 tastes of Rosé! @walshfamilywine @rosemontvineyards @stinsonvineyard \n.\nTag your favorite Virginia wineries and wines below!",
        "media_url": "https://scontent-dfw5-2.cdninstagram.com/v/t51.29350-15/106504748_293796955363116_6276577861290110600_n.jpg?_nc_cat=104&_nc_sid=8ae9d6&_nc_ohc=zi56c2mPz5oAX_MhYPr&_nc_ht=scontent-dfw5-2.cdninstagram.com&oh=7978e7ec2e507df211c1050ff1efe55b&oe=5F60A64A",
        "media_type": "IMAGE",
        "id": "18074176261203685"
    },
    {
        "caption": "Have you been missing these views? 🙋🏻‍♀️ We will be officially re-opening on Friday, June 19th and can’t wait to welcome you! \nTag the friends you love to drink Early Mountain with!\n\nReservations for our Tasting Room, Patio, and Back Lawn/Picnic Tables are available at Exploretock.com/earlymountainwinery\n\nProcedures and protocols can be found at Earlymountain.com\n\nPrefer to enjoy our wines at home? Never fear...curbside pick-up continues everyday and our online shop is open 24 hrs/day with UPS delivery to 32 states. \nOpen Hours: Fri- Sat, 11 am- 7 pm\nSun, 11 am - 5 pm\n\nWatch our stories for more info!\n📷: @aaronwatsonphotography",
        "media_url": "https://scontent-dfw5-1.cdninstagram.com/v/t51.2885-15/103842477_175754267234261_4229988561572568800_n.jpg?_nc_cat=110&_nc_sid=8ae9d6&_nc_ohc=iqa8GaEGeJwAX8n7h7h&_nc_ht=scontent-dfw5-1.cdninstagram.com&oh=946d165611542221e7687771a4c421a2&oe=5F638CFF",
        "media_type": "IMAGE",
        "id": "17850773585086379"
    },
    {
        "caption": "Bloom in our Chardonnay blocks at Early Mountain today. These delicate, almost imperceptible flowers emit a sweet fragrance and bring us one step closer to the 2020 harvest. 📷: @growinthatwine",
        "media_url": "https://scontent-dfw5-1.cdninstagram.com/v/t51.2885-15/102895174_647225025896098_2192134897238405064_n.jpg?_nc_cat=111&_nc_sid=8ae9d6&_nc_ohc=cBU-snD1o4wAX-ZBm9H&_nc_ht=scontent-dfw5-1.cdninstagram.com&oh=1ea0eea5f1e82398008a2ac4cb55584a&oe=5F63741E",
        "media_type": "IMAGE",
        "id": "17849184209134812"
    },
    {
        "caption": "Friends- we are postponing this tasting to allow the valuable needed conversations to happen this week without distraction. \nWe all need each other a bit more these days- we’re so thankful for the support of our partners and friends! Join us (virtually) for our June 6th “Taste of Virginia: Partners in Wine” featuring a global sampling from @williamscornerwine , our Charlottesville based distributor. We’ll delve into what makes wine “natural” with Nicolas Mestre one of the leading forces bringing this category to Virginia. Quartet pack now live in the online shop! \n@dirtyandrowdy Ca’ dei Zago Prosecco, @closdesmourres",
        "media_url": "https://scontent-dfw5-2.cdninstagram.com/v/t51.2885-15/81839505_304070580645937_3543713075943309119_n.jpg?_nc_cat=108&_nc_sid=8ae9d6&_nc_ohc=jxvnj0t2Zw0AX_Mt-lC&_nc_ht=scontent-dfw5-2.cdninstagram.com&oh=47f8f77cb2abf354799a274710d77d9b&oe=5F611FBC",
        "media_type": "IMAGE",
        "id": "17867032231820627"
    },
    {
        "caption": "Join us (virtually) to explore wines for the summer barbecue season. We’re thrilled to welcome @sbarnardwmkr from @keswickvineyards to chat why his Viognier is a perfect companion to veggies and seafood touched by fire and smoke. AND we’ll delve into the tradition of South African Braai compared to American Southern BBQ. This will be a delicious one! Pop over to EMV’S online shop for our Barbecue trio or grab your favorite wine for the grill and join in.",
        "media_url": "https://scontent-dfw5-2.cdninstagram.com/v/t51.2885-15/100955191_123925415975947_8778636784555403293_n.jpg?_nc_cat=104&_nc_sid=8ae9d6&_nc_ohc=j-v-KuN69p4AX9C8c_-&_nc_ht=scontent-dfw5-2.cdninstagram.com&oh=7058a77d470ca7c3c1dca0933920a9e8&oe=5F61ABBB",
        "media_type": "IMAGE",
        "id": "17879799934621884"
    },
    {
        "caption": "✨NEW RELEASE ✨ The Pet Nat is young, bubbly, insanely chuggable, and the perfect way to welcome the weekend. Available via our online shop (store.earlymountain.com) or curbside pickup.",
        "media_url": "https://scontent-dfw5-1.cdninstagram.com/v/t51.2885-15/98146880_2761691127392611_5841843244962727935_n.jpg?_nc_cat=110&_nc_sid=8ae9d6&_nc_ohc=Nsgsw14vPAQAX_hm4ef&_nc_ht=scontent-dfw5-1.cdninstagram.com&oh=508ca42e792fa13f650781cf92314cb0&oe=5F60F9A6",
        "media_type": "IMAGE",
        "id": "17866215157790761"
    },
    {
        "caption": "Next week’s (5/23, 5 pm)Taste of Virginia virtual tasting will be a special one! In celebration of #openlocalwine night, we are pulling bottles from the library, new releases and future releases for a discussion of how wines age and why we stash bottles away for future enjoyment. It will be team hosted, including our winemaking and leadership team (we basically all want to taste these stunners)! Instead of a tasting pack, we’re offering Eluvium, Vow, Rise, and new release, Intention, for 20% off until 5/24- choose 1, several, or pull your own favorite from your collection to taste along.",
        "media_url": "https://scontent-dfw5-1.cdninstagram.com/v/t51.2885-15/97116490_114542956704036_5635383599025278873_n.jpg?_nc_cat=101&_nc_sid=8ae9d6&_nc_ohc=Meqc_hBI5XIAX_jPsLA&_nc_ht=scontent-dfw5-1.cdninstagram.com&oh=ea3e49185ed5f2ad876b81427dd43b6c&oe=5F62085A",
        "media_type": "IMAGE",
        "id": "17850846785066006"
    },
    {
        "caption": "Contest alert! We are thrilled to welcome @amandalovessalt to Taste of Virginia:  Four Shades of Rosé virtual tasting tonight (5/16). Owner and creative director of @saltandsundry @littleleafshop and @thesunroomdc she’ll be sharing her Rosé inspired tablescape AND judging our #fourshadesofrosé submissions! Grab your @earlymountain Rosé, Taste of Virginia 4-pack or favorite beverage and join in! Post your own Rosé inspired table setting on IG or FB (#fourshadesofrosé) by 5:15 for a chance to win $50 gift cards to EMV and @saltandsundry",
        "media_url": "https://scontent-dfw5-1.cdninstagram.com/v/t51.2885-15/96939466_104937321158457_4183303018261878434_n.jpg?_nc_cat=101&_nc_sid=8ae9d6&_nc_ohc=yXnkCpEWEUMAX_LMgQG&_nc_ht=scontent-dfw5-1.cdninstagram.com&oh=f4a3281b944dc884565b2eaf5d0275be&oe=5F60A520",
        "media_type": "IMAGE",
        "id": "17891658880523998"
    },
    {
        "caption": "We are incredibly thankful for your ongoing support throughout this challenging time. It is wonderful to see so many of you join our virtual tastings, purchase wine through EarlyMountain.com, and support the many fine wine stores that carry EMV wines. We are proud of the way that those who have visited us in the past and those who have discovered us through our virtual events, and through recommendations from friends and wine merchants, have bought EMV wines to drink while they “Stay At Home”. ❤️\nWhile we are eager to reopen the tasting room at Early Mountain, we continue to put a priority on the safety, health and well-being of guests, employees and community. Virginia is allowing some establishments to open on a limited Phase I basis; however, we have determined that a further period of evaluation prior to opening our doors to the public is warranted.  We are currently planning on opening for an exclusive wine club member pick-up weekend on June 12th-14th.  We will be posting further updates as to any planned opening of the Tasting Room in the coming days. 🍇\nWe believe that patience and care need to be prioritized and will be monitoring this changing situation very carefully to ensure that Early Mountain continues to be the special destination that you know and love. In the meantime, our attention will remain on our vineyards and production facilities where our focus on quality is unwavering and making sure our wines are available to you through our online shop and curbside pickup.  We will also continue to craft thoughtful virtual tastings for our community to enjoy and are working on additional offerings to highlight craft Virginia products as well as sharing some special additional discounts as our way of saying thanks for your support.\n\nI hope everyone is staying safe and we look forward to raising a glass with you soon! \nCheers,\nDave Kostelnik, General Manager",
        "media_url": "https://scontent-dfw5-1.cdninstagram.com/v/t51.2885-15/97037931_243806326887472_2475533650732194749_n.jpg?_nc_cat=103&_nc_sid=8ae9d6&_nc_ohc=cfSgFU9SCYoAX8pzdSs&_nc_ht=scontent-dfw5-1.cdninstagram.com&oh=f6e3a474e1a7ba6fdf933a73c7d36146&oe=5F61CFAA",
        "media_type": "IMAGE",
        "id": "17884908349569231"
    },
    {
        "caption": "The upside of all-nighters on frost watch... gorgeous sunrises. 📸: @missmayarachel",
        "media_url": "https://scontent-dfw5-1.cdninstagram.com/v/t51.2885-15/97286852_574880246543157_5703333336705582175_n.jpg?_nc_cat=105&_nc_sid=8ae9d6&_nc_ohc=kiAh45ZdQQEAX-osJ7j&_nc_ht=scontent-dfw5-1.cdninstagram.com&oh=be218bc86c3618a7fc659479e1c64cf1&oe=5F61B5B1",
        "media_type": "IMAGE",
        "id": "17904987613458679"
    }
]